[
  {
    "text": "In my head right now I’m trying to figure out if I can swap with OP - LA for Paris…",
    "upvotes": 65
  },
  {
    "text": "Lmaoooooo pls God get me out of this fucking city\nMine and my wife's family still live here and her parents are old as hell my grandpa is old as hell the only reason we are still here is we rent his second house for cheaper than our last apartment",
    "upvotes": 5
  },
  {
    "text": "Paris is just as dirty and graffitied maybe even more. ",
    "upvotes": 3
  },
  {
    "text": "Thats just bullshit.",
    "upvotes": 1
  },
  {
    "text": "I've been to both. I've never seen so much grafitti in my life until I went to Paris ",
    "upvotes": 1
  },
  {
    "text": "Ask OP for work reference and you guys swap places to stay lol",
    "upvotes": 1
  },
  {
    "text": "Just a tip: Don’t call yourself “celibates.” In English, a celibate is a person who swears off any sexual activity.\n\nYou can imagine how offended I was when — as a French language learner — someone asked me if I was “célibataire.” Until I realized it just meant “single.” \n\nSay “we’re single” instead of “we’re celibate” unless you really are people who avoid all sex.",
    "upvotes": 13
  },
  {
    "text": "I just edited my post. Thanks for telling me!",
    "upvotes": 4
  },
  {
    "text": "Culver City is a nice area. You could also live in Venice Beach or Santa Monica, but I like Culver City. Advice for living in LA? Get a car, preferably a hybrid. This is not Paris. It's not a walkable city. You need cars to get around and you'll have to deal with the insane traffic.",
    "upvotes": 35
  },
  {
    "text": "Sure, we were already planning on getting one. I know that we'll have to drive a lot, so that's why I want to make choices in order to minimize the time spent in traffic!",
    "upvotes": 10
  },
  {
    "text": "The only way to minimize time in traffic is to live close to work and when you go anywhere, you literally have to plan everything around the traffic.",
    "upvotes": 15
  },
  {
    "text": "You can bike from venice (or marina del ray) to Culver easily, there's a bike path that is completely off the street called Ballona Creek.  There are also decent bikelanes in Venice, Culver, and Santa Monica.\n\nThere is also decent public transit via the Culver City bus network or LA metro E line.\n\nI occasionally bike to work from culver city to el segundo but it is a long ride.",
    "upvotes": 9
  },
  {
    "text": "I agree.  This is totally plausible for a single person.  I biked and took public transit in LA for almost 2 years and was very happy.  I lived/worked in Santa Monica (5 mile one-way commute), but would often go to West Hollywood and DTLA.\n\nI’d personally look for a place within walking distance of the necessities (grocery store, dry cleaners, bars/restaurants) and then scrutinize bike paths between work and home.  This last part is key.  \n\nBallona Creek does seem to be near where OP will be working, so this could be an excellent resource.",
    "upvotes": 9
  },
  {
    "text": "this is all well and good, but unfortunately it is a logistical nightmare compared to driving (born and raised in culver city)",
    "upvotes": 3
  },
  {
    "text": "Live as close to work as possible. A 10 mile commute isn't going to be 20 mins, even though it should be.",
    "upvotes": 2
  },
  {
    "text": "If traffic is a concern, I would look up public transportation. It used to be shitty 15 years ago, today it's pretty nice, clean, and safe. You'll still need a car but life is way less stressful if you can just do public transportation to work. \n\nI have a friend who rides the Gold Line to work (other side of town from where you are) because traffic was literally making him go insane. Cut his commute from an hour in traffic to 20 minutes. \n\nYou can take the Big Blue Bus from Santa Monica to Culver City, and you can bike from your stop to work (but always wear a helmet because L.A. traffic is...insane). The E Line (light rail) works, too. \n\nSanta Monica is nice, and on a combined salary of 300k you all should be able to find a great place. If you do the 30% of your salary (pre income tax) is rent thing, combined you guys can probably spend 7,500 a month. You can absolutely find fantastic 2 bedroom apartments in the 5-6k range, so you don't even have to spend that much. \n\n I'd check out apartments within walking distance of where you can pick up the bus or the E Line. \n\nCulver City, Venice, and Sawtelle are also worth checking out. Mar Vista is nice, too. Palms is fine and cheaper than the other areas, but not as nice. I wouldn't go any further than those cities though if traffic is a concern.",
    "upvotes": 1
  },
  {
    "text": "Don’t move to Santa Monica, it’s terrible there.  The people are mean and there’s a lot of crime. Live in Culver City near the E line it will feel just like Paris or better, you’ll never have to worry about driving.",
    "upvotes": 1
  },
  {
    "text": "as someone who lives here and is not mean and has not witnessed any violence, you might be exaggerating a bit",
    "upvotes": 2
  },
  {
    "text": "This is utter nonsense.  I worked there for 15 years.  Santa Monica is nice.  Some homelessness, but that is really the only downside.",
    "upvotes": 1
  },
  {
    "text": "Lots of people with flexible jobs do not have cars in LA. If you are resourceful and have a flexible work option, there is no need for them. I can’t be without in my current situation but if I had a job on a coastal city or remote, you bet I would ditch my car. Instacart, Amazon and Doordash have really removed the need for me to have a car to shop. You can also Uber, Turo or rent a car on the rare occasion you need to get to a specific place and back with ease and lower price than Uber",
    "upvotes": -1
  },
  {
    "text": "Your advice- get a car to make more self made car traffic and get ready to deal with the insane amount of self made car traffic...\n\nSolution- try to drive as little as possible for the mundane daily living tasks and reserve the car for leisure/getting out of town driving instead.",
    "upvotes": -4
  },
  {
    "text": "Lol.. you have clearly never lived in Los Angeles. Your comment is hysterical.",
    "upvotes": 3
  },
  {
    "text": "Ha, I'm a LA native reformed car brain.  \n\nNow I walk/bike/take transit and am much healthier and wealthier and never stuck in self made car traffic!",
    "upvotes": 3
  },
  {
    "text": "Culver City/Palms area itself is good. Santa Monica or Venice work as well. You can bike. Check out the Ballona Creek Trail. Runs right through Culver City and comes out at the coast in Marina Del Rey.",
    "upvotes": 17
  },
  {
    "text": "Thanks, I'll have a look! I feel like people usually consider Palm's when they want to live in a \"cheaper Culver City\", is that right?",
    "upvotes": 5
  },
  {
    "text": "Yes. There are a lot of new apartment buildings in both Culver City and Palms.",
    "upvotes": 4
  },
  {
    "text": "Yes. The main benefits of Culver City are better schools and better cops. There are a few luxury apartment buildings in Culver as well. Even if you can afford the higher rent I'd probably recommend Palms at your age with no kids.",
    "upvotes": 2
  },
  {
    "text": "Culver City and either walk or cycle to work. It’s a beautiful neighborhood with lots of restaurants downtown. If not, pick something close to the E line (formerly expo). The west side has better weather, so Santa Monica would be great. Or Venice. You can afford it. From SaMo and Venice to downtown Culver City is about 30 min bike ride. Other options: Sawtelle, West LA. Check Trulia.com for rentals.",
    "upvotes": 9
  },
  {
    "text": "Thank you!",
    "upvotes": 1
  },
  {
    "text": "The first rule of living in LA is to live close to where you work.  Otherwise the commute/traffic will grind you down.  If you’re working in Culver City, then live in Culver City.  With your combined budget, you can afford a very nice place.",
    "upvotes": 4
  },
  {
    "text": "I would be mad if the office was in a bad area, but it feels like I have two strong arguments to live in Culver City. Thanks!",
    "upvotes": 2
  },
  {
    "text": "I've lived in Culver, Marina Del Rey, Venice/Santa Monica, and Brentwood. Happy Hour traffic in Culver can be insane, depending on what part you are in. You used to be able to get \"more for your money\" in Marina. Not sure if that is true, anymore\n\nMarina/Mar Vista is actually the most centrally located to the things you want. It's a straight shot by bike into Culver. A short bike or Uber to Venice and Santa Monica \n\nPersonally, I preferred Brentwood because it put me closer to the Santa Monica mountains and hiking/mountain biking.  Less foot traffic and noise. Also, a straight shot down Wilshire or Sunset to Hollywood/West Hollywood. But, I'm an LA native. So, I already knew where everything was. \n\nYou really can't go wrong in any of those places. But, without a car, I'd aim for Venice, Mar Vista, Marina",
    "upvotes": 1
  },
  {
    "text": "Just want to double down on the importance of what the other person is saying. I highly recommend sitting down with google maps and saving off your future workplaces, points of interest, beaches, places where you’ll do potential hobbies and such, and make a grid of when and how much you might drive to certain places, whether public transport is feasible if you’re in a certain spot, etc, and then target specific blocks rather than areas based on that. \n\nDriving in LA is unmitigated hell, both in terms of how drivers behave and how much traffic there is, and the less you do it, the more you’ll enjoy living in LA. You’ll be really grateful if you use solid analysis to make this call and not vibes or educated guesses. ",
    "upvotes": 1
  },
  {
    "text": "I don't think LA is really a bikeable city. Traffic is too crazy. Maybe I'm cautious in that respect.",
    "upvotes": 3
  },
  {
    "text": "The west side is perfect for bikes.",
    "upvotes": 1
  },
  {
    "text": "In some ways. In some areas. I guess I've just driven passed too many drivers looking at their phones.",
    "upvotes": 2
  },
  {
    "text": "My only advice: stay in a hotel for a month before u pick. That will give u time to buy a car. Visit the complex / triplex in person. Playa Del Ray and Marina Del Ray are close to the beach less than 10 miles.Culver city has some not so good ares. Perhaps 80% is great. If u never make a bad judgment on where to visit and how late at night and who u trust as a friend u will love LA and OC, SD, Ventura county.",
    "upvotes": 3
  },
  {
    "text": "The number one thing on this sub is “live near where you work” your job is in Culver City, Culver City is a nice place, just live there. You guys could split a car for big errands but if you live within walking distance of a grocery store you’re set. Just get a wagon to carry your stuff from target or whatever and a bike to get around. Also there is a metro stop in culver to get you into downtown and beyond. One day they’ll even build the Sepulveda line.",
    "upvotes": 3
  },
  {
    "text": "With that kind of salary you can live anywhere why not look for a place near the beach that's what I would do.",
    "upvotes": 6
  },
  {
    "text": "Hey sooo I make more than that and sheesh. With retirement and other costs factored in (let’s be real- social security is going away best prepare) living by the beach is still a bit of a stretch. It’s somehow still not enough.",
    "upvotes": 4
  },
  {
    "text": "I doubt they'll retire here, they'll just make enough and just go back home, that's what I would do if I lived somewhere that is cheaper than the U.S.",
    "upvotes": 2
  },
  {
    "text": "OP mentioned they were celibates. I’m guessing living near the beach would be a problem cause of all the tempting hotties.",
    "upvotes": 1
  },
  {
    "text": "If you work in Culver City, I would definitely live there. It's centrally located for access to West LA and Santa Monica, beaches and other interesting activities.",
    "upvotes": 2
  },
  {
    "text": "Thanks! Looks like it is what people here recommend the most.",
    "upvotes": 1
  },
  {
    "text": "With your combined salaries and the close proximity to Culver City, consider a high-rise luxury condo overlooking the beach at either Santa Monica or Del Ray. Fantastic budget. The world (or in this case the \"So Cal beach scene\") is your oyster! 🙌",
    "upvotes": 2
  },
  {
    "text": "Haha thank you! Santa Monica feels too \"far\" from the office though, considering traffic. However, I'll have a look at Del Rey. How would you compare it to Culver City? To be honest, I don't value \"luxury\" that much, however being close to the beach is definitely something I'd enjoy. But I don't want it to be at the coast of having no bars and no walkable area where I live, I believe",
    "upvotes": 1
  },
  {
    "text": "My daughter lives in Mar Vista (right next to Culver City) and commutes to work every day. Mar Vista is a more family orientated/young adults area, peaceful and mostly quiet. Takes her about 15-20 minutes \"tops\" during rush hours from Mar Vista to Culver City. Del Rey, (Marina Del Rey) is an entirely different \"vibe\" than Culver City. Del Rey is a lovely Marina with cool yachts in boat slips galore and a ton of shops and restaurants. Culver City, has more of a \"fun funky youthful vibe\" and has a lot of restaurants and clubs within walking distance. \n\nLastly, don't let the \"luxury element\" of those Santa Monica high rises deter you from at least taking a peek! The **VIEWS** are absolutely incredible!!!",
    "upvotes": 2
  },
  {
    "text": "Proximity to the beach is a luxury. Venice and Santa Monica commutes to Culver City are quick compared to most commutes in Los Angeles. Culver has a good amount of walk ability but if you really value beach time it’s best to be in Venice or Santa Monica so you can walk to the sand instead of looking or paying for parking.",
    "upvotes": 1
  },
  {
    "text": "Remember if you're close to the beach- it'll be overcast and cooler most of the year.  \n\nIts great to escape the summer heat but personally, I'd get depressed living somewhere that's cold/overcast year round. \n\nAnd it's LA coast is very different (vibe/population/density) from coastal France, except for maybe the $$$$$ factor.  \n\nCulver City is probably your best option to live and work.  \n\nThey used to have actual bike infrastructure but the car brained nimby's got it torn out (returning to the same terrible car traffic) and now its a combined Bus AND Bike lane.",
    "upvotes": 1
  },
  {
    "text": "I second this. A co-worker got a place in Venice Beach and moved there for a year. He got a job offer back East and moved but before he did I asked him how he’d enjoyed his year on the legendary beach. “Seemed like the sun almost never came out for the whole year, except for a couple hours in the evening”, he told me.",
    "upvotes": 1
  },
  {
    "text": "Live in Culver City. Bike to work and maybe the beach, depending on how much you like biking. Venice is the closest, which is always energetic but sometimes you might want something quieter, which you can find north or south of there.\n\nGet a car for everything else. As someone else said, LA is comprised of a bunch of neighborhoods spread out. There’s so much to do in each neighborhood, it’s easy to never leave your side of town. And while you can technically get from neighborhood to neighborhood without using a highway, it’s not advisable. And our public transportation is awful. Even if you both share a hybrid or EV for now.\n\nCulver is chill but has tons of great restaurants and coffee shops. Not sure about nightlife if that’s your jam. I’m not sure if you’re roommates right now already, but I recommend getting a nice flat where you both have enough space, since figuring out a new city, and country, while living on top of each other can be overwhelming even for the best of friends. And have someone look at the place before you move in. There are lots of scammers out there, especially after the fires and people were scrambling to relocate. I know I’m an internet stranger who could very well be one of those scammers :) But I’m happy to help if I can. And congrats on the jobs!",
    "upvotes": 2
  },
  {
    "text": "Wow that's a very valuable comment here. We're not really into nightlife [anymore] so this should not be an issue. \n\nI may contact you later then, thanks again!",
    "upvotes": 1
  },
  {
    "text": "Despite all the naysayers who say its not possible (b/c they've never tried) it is possible to walk/bike/transit in LA.  \n\nLA is a huge city w/no real center.  Instead, every neighborhood has its own hub/center.  \n\nPublic transit connects between and within the neighborhoods and its possible to walk/bike as well, though some neighborhoods are better connected/developed for living car free/lite.  \n\n(e)Bikes are allowed on subways and every Bus has a front rack that holds 2 bikes and you can bring a folding bike/scooter inside the bus.   \n\nConsider a trifold (Brompton or clone BrompNot) for easy multimodal traveling.\n\nYou already know how much easier life can be not being stuck/dependent on a car.  \n\nIt won't be the same as Paris but its not impossible either..... this is coming from a native LA former car brain that would default car drive for a errand 2 blocks away that chose to get rid of their car and live a car free life instead!",
    "upvotes": 2
  },
  {
    "text": "Sounds good!\n\nAnd just for reference, nightlife means a lot of different things here. There’s dance clubs, with and without drugs, crowded bars, concerts, chill bars, sports bars, gay bars, nice restaurants with a good meal and glass of wine, theatre, and probably lots of other things I’m forgetting. The weather is beautiful 95% of the time so we spend a lot of time outside, most places have nice patios or rooftops. For some people, that’s also when they like to go to the beach, it’s beautiful and peaceful.",
    "upvotes": 1
  },
  {
    "text": "I think Culver is a great choice - decently walkable, social scene, close to work, etc\n\nVenice has more character, a little further, some more homeless, close to the beach\n\nManhattan beach is nicer, safer, but further and less lively",
    "upvotes": 2
  },
  {
    "text": "Johnny's pastrami.",
    "upvotes": 2
  },
  {
    "text": "I was there last week and they gave us the biggest sandwich and onion rings we’ve ever had there. 😋",
    "upvotes": 1
  },
  {
    "text": "Company in the tech hub of the country thinks it needs to literally go to Europe for talent when it’s less than a hour away from great top-ish tier schools.\n\nThis is why our graduates can’t find or keep jobs.",
    "upvotes": 2
  },
  {
    "text": "What job at 25 pays 150k a year?",
    "upvotes": 3
  },
  {
    "text": "They are engineers.",
    "upvotes": 4
  },
  {
    "text": "Software? Civil?",
    "upvotes": 0
  },
  {
    "text": "It’s a start-up.",
    "upvotes": 5
  },
  {
    "text": "What does that mean/matter?!",
    "upvotes": -2
  },
  {
    "text": "Typically tech",
    "upvotes": 4
  },
  {
    "text": "There are many non tech startups in the world though",
    "upvotes": 1
  },
  {
    "text": "There are, but you asked what does that mean, and that’s what people mean. While words have their original or technical meaning, there is also the meaning that most people use it in.\n\nFor example, Christianity, Judaism, and Islam are all Semitic religions. But when people say anti-Semitic, they “mean” Judaism",
    "upvotes": 1
  },
  {
    "text": "So start ups are hiring 25 y/o for $150k often? Or youre just saying tech ones?",
    "upvotes": 1
  },
  {
    "text": "many tech startups will pay 25 year old software engineers 150k, if not more. It’s not the norm but it’s not rare either",
    "upvotes": 0
  },
  {
    "text": "This all smells very fishy from the employer side. Scores of unemployed American engineers in LA right now desperate for jobs. Many are a few months from exhausting savings.",
    "upvotes": 2
  },
  {
    "text": "I have background in machine learning (computer science, statistics) and will work as a data scientist / backend engineer in this startup. Same for my friend.",
    "upvotes": 2
  },
  {
    "text": "Im not mad at ya, just asking!",
    "upvotes": 2
  },
  {
    "text": "Meanwhile there are plenty of US citizens absolutely struggling to find these jobs but okay",
    "upvotes": 1
  },
  {
    "text": "Oh yeah.   The USA is chock full of unemployed data scientists.    🙄",
    "upvotes": 1
  },
  {
    "text": "It is. The economy is in the toilet. I’m not saying these two are at fault, I’m just saying I might want to know the economic condition of a country before I move halfway across the world for a start up of all things",
    "upvotes": 3
  },
  {
    "text": "It is right now lol",
    "upvotes": 2
  },
  {
    "text": "Are you being serious? We just went though some of the worst tech layoffs since the pandemic…\n\nYou can’t be serious….right?",
    "upvotes": 2
  },
  {
    "text": "🤷🏽‍♂️. Tech workers are not data scientists.",
    "upvotes": 0
  },
  {
    "text": "There’s layoffs everywhere. Every. Where. Not to mention data scientists being laid off by govt funding cuts. Wake up.",
    "upvotes": 1
  },
  {
    "text": "Well then I’m happy for this couple who managed to get a job with what’s going on. \n\nGood for them!    It’s a free world (or should be) and the fact the owner thought this French couples experience and knowledge was enough is fine with me.  \n\nLame to think someone owes you something simply for being born in the USA",
    "upvotes": 1
  },
  {
    "text": "It’s not a free world. Wake up.",
    "upvotes": 1
  },
  {
    "text": "Then maybe we should embrace as much as we have left?    Good for this couple!!",
    "upvotes": 1
  },
  {
    "text": "I’m in the engineering field too that have worked at start up. And they will work you!",
    "upvotes": 1
  },
  {
    "text": "Marina Del Rey!",
    "upvotes": 1
  },
  {
    "text": "You can afford to rent a house together in Culver City with garage and washer dryer. I am going to say rent will be about $6000. The city is bike friendly and you have a train stop to take you to Santa Monica and downtown LA  without a car.\nComing from a place where people take public transit everywhere, I think you would be best served living near your job and biking there. An ebike can be super helpful for uphill treks, it has been the best purchase ever.\n\nI live in Santa Monica and I love it here. going South in the morning and North in the evening on the 405 freeway is the best way to beat traffic. You do not want to drive towards LA in the morning. \n\nAnother pocket I really like is El Segundo. Super close to LAX, walkable to the beach, clean and quiet with a cute main street with restaurants and shops. You can do a quick Uber to Hermosa Beach, Long Beach or Marina del Rey for partying.",
    "upvotes": 1
  },
  {
    "text": "Culver City, Mar Vista, Playa Vista.   Check out Westside Rentals for a good site to find a place.",
    "upvotes": 1
  },
  {
    "text": "I grew up in Venice Beach (so I’m a bit biased), but this part of LA is easily my favorite part of the city. I would suggest living in Venice, Santa Monica, or MDR. It’s awesome taking bike rides from Venice to Manhattan Beach or in the other direction to SM/Malibu on the weekends. There are so many incredible restaurants and random things going on in Venice/SM every week that you can’t ever be bored in this part of town. Another perk is that it’s a lot cooler in these coastal towns during the hot summer months since you’re right by the beach. As someone else said, if living in Venice/MDR, you can bike to work using the Ballona Creek bike path. Wishing you the best on your upcoming move!!",
    "upvotes": 1
  },
  {
    "text": "Maybe an air bnb for a month or two would give you both a chance to explore your options before you commit to a lease.  I’m glad you have this oppurtunity, but be sure to add an escape clause to your lease in case the idiots currently running the country decide they don’t want you here.  I’m not joking, they are fixated on immigrants in a very strange and unhealthy way.",
    "upvotes": 1
  },
  {
    "text": "You can live anywhere in LA off $300k a year.\n\nConsidering you’re coming from Paris I’d get the beach life and live by Venice or in Mar vista",
    "upvotes": 1
  },
  {
    "text": "Y’all make\nEnough to live confortably when you you share a 2b apartment.",
    "upvotes": 1
  },
  {
    "text": "One more: I have not visited Paris but LA has too many biking accidents. Some or a lot of LA drivers are maniacs and many are under the influence or with an angry mind set. Avoid bars in Hollywood or LA IMO. If remote is possible or hybrid OC and Ventura county are very safe, nicer people, very few gangs. Thousand Oaks, Calabasas. Irvine, Dana Point, Laguna beach are very beautiful and safe.",
    "upvotes": 1
  },
  {
    "text": "Culver City also has Des Crossiant Paris, the owner and baker is French and imports all his butter and flour from France. In case y’all miss a taste of home. \n\nBut it’ll be an LA priced Crossiant",
    "upvotes": 1
  },
  {
    "text": "Santa Monica &amp; Venice are great and fun. Easy commute to Culver",
    "upvotes": 1
  },
  {
    "text": "Could send you some great leads",
    "upvotes": 1
  },
  {
    "text": "Marina del Rey, Venice beach or Santa Monica at your age and salary.  Lots of young people and good bars and restaurants in this area",
    "upvotes": 1
  },
  {
    "text": "Culver City is nice, but also look at Playa Del Rey and maybe Manhattan Beach.",
    "upvotes": 1
  },
  {
    "text": "Living on the westside you'll need a car.  Or really anywhere in L.A. if you love nature and want to get out a lot on the weekends.  Do either of you drive in Paris?  \n\nLook in Culver City if you can find something downtown/walkable.  That'll make at least your first year easier as you try to adjust to a completely different lifestyle.  You'll have the rail to get you to Santa Monica/the beach easily until you secure your own car, you can also bus or Uber easily to Marina del Rey and Playa del Rey.  \n\nIf you're not coming with furniture etc then it might be best to get an airbnb or furnished corporate apartment for two or three months while you explore and decide where you want to live.",
    "upvotes": 1
  },
  {
    "text": "Culver City Fox Hills with park, mall, dining, and Culver City buses that take you all over the city within walking distances to everything. It’s the only park with alots of condos and apartments so you will meet alot of people.",
    "upvotes": 1
  },
  {
    "text": "Hey brother welcome to LA! Yeah 150k is more than I make by triple and if you're making 75k then you'll do just fine. Rent will of course be steep and you're not going to be living in complete luxury, but that amount of money is enough to get you in a car and live in a decent apartment.\n\nCulver City is considered bikeable (It is actually one of the only cities in the LA area that I believe focuses on walkability), but this is not Paris. Los Angeles and America in general are car centric and you will find out quickly how far things are (biking places is not a bad idea, but you will be limited in where you can go).\n\nCulver City is not technically close to the beach, but you are a 15-20 minute drive, maybe 30-45 minute bike, to the beaches. \n\nLA, especially near the beaches such as Santa Monica, Marina del Rey, Venice, has a lot of French folks and you'll likely find a decently big community out here (although they may be on the higher income side)\n\nNote that LA traffic is famous for its horror. I ride a motorcycle and I suggest you learn how to as well, but that's really a niche option that most people will understandably not do it.",
    "upvotes": 1
  },
  {
    "text": "Culver City is an ideal place to live in! You can definitely walk or cycle to work! It's a good 20-30 minutes driving to the beach but you still enjoy that warm and breezy beach weather!\n\nGood luck and have fun! Welcome to LA!",
    "upvotes": 1
  },
  {
    "text": "If you can afford it, maybe Santa Monica or if you don’t mind the commute, maybe the Beach Cities like Hermosa Beach, Manhattan Beach, Redondo is a little far. Culver City or Venice.",
    "upvotes": 1
  },
  {
    "text": "You Should look at Manhattan Beach and Hermosa Beach. You would love it there.",
    "upvotes": 1
  },
  {
    "text": "We live in Playa del Ray which is decently close to Culver city (20 min by car which is considered close in LA). Walkable to the beach.  Nature is more north in the valley which you\nCan get their on weekends early enough\nFor a hike.  \n\nYou are going to want to be close to the office if you work from there as traffic is awful in La.\n\nAlso my wife (late 20s) is French Canadian and always looking for more French speakers  to join her French speaking crew ",
    "upvotes": 1
  },
  {
    "text": "If you have no rental history or credit score, it may be an uphill battle to rent. Maybe call around to ask, I’m not sure of legality but some landlords might try to ask for several months of rent upfront. Will your company help secure housing?",
    "upvotes": 1
  },
  {
    "text": "culver city is a great area, and far more walkable than many neighborhoods. if you can find something there, i'd stay in culver ",
    "upvotes": 1
  },
  {
    "text": "With your salaries, you’ll be able to easily afford a nice place anywhere honestly. I would shoot for any beach near Culver City.",
    "upvotes": 1
  },
  {
    "text": "If you can live in Culver City and walk or bike to/from work, you will have an incredible LA experience. The area around downtown is one of the most walkable neighborhoods in LA (I walk at least 6 miles a day), and Venice, Marina, and Santa Monica aren't that far away. 20 minutes to LAX is really nice too if you fly a lot. You'll still want a car to get the full California experience and run to Target, Ralph's, etc, but I've had mine for seven years and only put about 45K on it, mostly from road trips around California and the American West.",
    "upvotes": 1
  },
  {
    "text": "Culver city is a good location.  It’s relatively close to the beach and you can ride a bike there via the Ballona creek bike path which is ~5 mile ride between the beach and culver.\n\nYou could live anywhere along the bike path.  Marina Del Rey, del Rey, playa vista are all good neighborhoods.\n\nIf you’re getting 150k it’s likely parking will be provided, and culver is pretty central.  Traffic around there doesn’t get backed up except during peak rush hour around 6-6:30 so just leave a little earlier or later and traffic is a non-issue if you’re not going to dtla, Hollywood or the valley.",
    "upvotes": 1
  },
  {
    "text": "At your age with solid incomes…find a place in Manhattan Beach….north of the pier south of Rosecrans Ave. You can enjoy the best of the beach life and can take Rosecrans to the 405 or take Vista Del Mar along the beach on the drive to work every day. Another stealthy good centrally located spot is Playa Vista. Close to everything and very walkable. Gyms, pools, are included in the rentals 99% of the time. I live here…its great",
    "upvotes": 1
  },
  {
    "text": "Culver City is nice and close to other areas with nightlife and restaurants.  Living there, you'll eliminate one of the worst parts about LA the commute..  it'll save you serious money, too, on gas and auto insurance.   When a company I worked for moved my commutevwent from 30 minutes to 90+ minutes and I was putting 100k miles on my car per year.  Commuting from my house in the SFV to downtown LA was about  1 hour each way, and if my company didn't pay for parking, the cost would have been horrendous.  I needed a car for work, so driving to a train station and then taking a light rail or the subway wasn't possible.  If you live and work in Culver City, you could easily bile to work if your job doesn't require a car, but you'll  still need cars.\n\nPublic transportation stinks, and LA is a car city. Unlike a European city which is concentrated ours is spread out and huge.  Paris is 41 sq mile, and the entire metropolitan area is 890 square miles.  Culver City, which is tiny, is 5.1 square miles.  Just the City of Los Angeles is 502 sq miles, of which 30 square miles is water.  The metropolis is 4,850 square miles, and the statistical area is something like 9 or 10 times larger still..  People here drive to where they want to walk or shop. You drive to the grocery store. Unless you live in a pretty unusual area of LA, don't expect to find neighborhood mom and pop small grocery stores and shops right around the corner that you can walk to. Unless you're always going together, you'll both need cars.  You don't need a flashy, expensive car, though a lot of younger people get them. Personally, I'd go for dependability over flash.\n\nI measure distance not in miles but in time to determine if I want to go out to some place.   Depending on the time of day",
    "upvotes": 1
  },
  {
    "text": "Culver City or adjacent is a great place to live and the two of you will be able to afford a lovely place at that salary.  It is central to the 10 freeway and has accessible transit on the expo line, as well as ample shopping and dining in walking distance.  \n\nDuring the week it will be easy for you to access any place west in the evening as well as Century Cuty, Westwood, or Beverly Hills, and WeHo.  If you have to get to DTLA during week nights take the Expo line and uber back. On the weekends you will be able to explore the whole city - and you should!  LA is filled with amazing neighborhoods and cultures - it takes work but it opens up one little place at a time.  \n\nEnjoy your new home!",
    "upvotes": 1
  },
  {
    "text": "Culver City or mar vista sounds like a good spot. Walkability in these areas is nice. It’s also close to the beach. You will need a car though if you want to go out and about (some people I know just uber for the days they want to do like once or twice a month, but having. A car makes your life so much easier). \n\nIn terms of nature, besides the beach, westside isn’t the best for that anymore cause of the fires- I mostly used to hike in Malibu, but if beach fits that niche or you don’t mind traveling I think you’ll enjoy Culver/mar vista/venice.\n\nBest advice in LA: live where you work. You’ll be a happier person",
    "upvotes": 1
  },
  {
    "text": "I live and work in the greater LA area.\nCheck out Hermosa and Redondo Beach.\nI prefer Hermosa Beach. City of Torrance is close and may be a little less expensive.",
    "upvotes": 1
  },
  {
    "text": "Quick hits bc you got plenty of good answers: \n\n- Culver is great; know a ton of int'l relocated engineers start there bc of Techstars \n\n- If you're looking to network with similar peeps, look up Techstars LA - they host tons of events\n\n- Once you're here, Lu.ma is good for finding parties for networking socializing \n\nI know folks who did the same thing, made friends in the same boat who could help answer their questions, and built from there. \n\nGood luck!",
    "upvotes": 1
  },
  {
    "text": "If you don’t have a car it will be much easier to stay in Culver City. If you have a car, Marina Del Rey/ Venice / Playa Vista are options close to Culver City but more expensive. Like others have said, LA is very spread out and traffic gets really bad.",
    "upvotes": 1
  },
  {
    "text": "Culver City is where you want to be. There’s a bus depot and a train station. CCPD are way better than LAPD as far as being safe. The center is thriving with retail, restaurants and theaters. The temperature is cooler than most of the rest of Los Angeles and it’s attractive; you literally notice the difference as you drive into CC mainly due to the lack of billboards. If you enjoy bike riding there’s a path along the creek down to the beach.",
    "upvotes": 1
  },
  {
    "text": "300k is renting class still",
    "upvotes": 1
  },
  {
    "text": "There are a bunch of apartments near downtown Culver City on the culver/palms border.  Pull up your job’s address on google maps, zoom in, look at the apartment buildings nearby.  Try and get a place to share within walking/biking/bus distance. If you decide another area is more your speed when your lease is up you can move, but that’s a nice area, walking to work is great. There’s grocery stores over there, too.  So if you take longer to get a car to explore further it’s fine.",
    "upvotes": 1
  },
  {
    "text": "Yes you can bike to work in that area, and there are a lot of reasonably-priced places to live near by. In Culver City, Palms, Mar Vista etc.",
    "upvotes": 1
  },
  {
    "text": "Just start in Culver. WARNING: LA IS NOT REALLY A CITY! It’s a collection of towns that kind of just smushed together. Not being negative just want you to be aware that “ This is not Paris”. Anyhow, from what you are describing… just get something in Culver. It’s plenty walkable especially by city hall. It’s possibly bike-able to the beach (a few miles). FYI tho, I lived in LA for 6 years, I rarely felt the need to go to the beach. But, if you must live very close to the beach then try Marina Del Rey or parts of Venice, maybe Mar Vista.",
    "upvotes": 1
  },
  {
    "text": "That's what I quickly started to understand, thanks for the input.\nI may be wrong, but I believe I'll try to spend a good amount of time at the beach. Can I know why you rarely went there?",
    "upvotes": 2
  },
  {
    "text": "If you’re interested in the beach, then I would look for places to live by the beach and commute to CULVER CITY. The beach neighborhoods are very different and have a vibe all to themselves.",
    "upvotes": 5
  },
  {
    "text": "June Gloom is one reason.  The marine layer, a white fog, does not burn off until  the mid afternoon. Unlike the warm water Florida beaches on the Gulf of Mexico,  the water of the Pacific ocean is cold. \n  West Hollywood is usually 10 degrees warmer than coastal cities. And cities like Burbank in the valley are another 10 degrees warmer than West Hollywood.",
    "upvotes": 3
  },
  {
    "text": "Yep Culver and Palms area are one of the nicer areas so might as well focus there.  Then there's the westside/beverly hills but traffic is terrible, costs are high and as you recently may have seen it's not great to live around lots of trees in this heat.",
    "upvotes": 1
  },
  {
    "text": "You lived in LA for six years and rarely went to the beach? Just curious why? For me it’s top 3 best parts of the city.",
    "upvotes": 0
  },
  {
    "text": "The beaches (the water) in LA are always contaminated and being shut down. Been here 5 years and wouldn’t dare step in that water, bacteria, sewage spills etc",
    "upvotes": 0
  },
  {
    "text": "Culver City is a great area for two single ladies. It is very walkable and you could walk to work. The parking sucks though. Harlow and Coda apartments are close to city hall",
    "upvotes": 0
  },
  {
    "text": "What do you mean for single ladies?",
    "upvotes": 1
  },
  {
    "text": "Food, bars, movie theater, and local theater. There’s also a bike path to the beach!",
    "upvotes": 1
  },
  {
    "text": "Amazing! Thanks for your comment",
    "upvotes": 1
  },
  {
    "text": "Once you guys are out here you can get a feel for each neighborhood and possibly move after a year. But I’d say Culver City is generally well liked, so is a great starting point.",
    "upvotes": 2
  },
  {
    "text": "They misread your post and think you are two women.",
    "upvotes": 1
  },
  {
    "text": "I guess I just mean for young single women it is generally safe and there is lots to do! I am married with a child and will be moving to a more residential area.",
    "upvotes": 0
  },
  {
    "text": "With those salaries I’d be looking into buying a house instead of being stuck renting for the rest of my life. \n\nOfcourse someone else did bring up the point do you want to live close to work or give up part of your life to the commute.",
    "upvotes": -1
  },
  {
    "text": "They’re at a startup.\n\nPlenty of time to “buy a house” if it blossoms.  Not the time if it folds.",
    "upvotes": 2
  }
]